Tekla Open API Reference for Tekla Structures 2025
Chamfer.Y Property
 The second dimension of straight chamfers.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public double Y { get; set; }
Public Property Y As Double
	Get
	Set
Property Value
Type: Double
See Also
Reference
Chamfer Class
Tekla.Structures.Model Namespace